[
  {
    "category": "Popular homes in Kuala Lumpur",
    "listings": [
      {
        "title": "1 Bed Studio with KLCC View/Rooftop Pool - Netflix",
        "price": "$118 for 2 nights",
        "location": "Kuala Lumpur",
        "rating": "4.91",
        "url": "https://www.airbnb.com/rooms/30302225",
        "details": {
          "amenities": "",
          "baths": "1",
          "bedrooms": "1",
          "beds": "1",
          "description": "Close to Kuala Lumpur heartbeat and the majestic KLCC Petronas Twin Tower, Shopping Paradise of Bukit Bintang and food and entertainment outlets in the Golden Triangle. All rooms are overlooking the majestic KLCC Twin Towers and the Titiwangsa lake. We offer hot water shower, AC and a well furnished clean room. The infinity pool overlooking the stunning view of KLCC and KL Tower and Kuala Lumpur panoramic view. As a safety percaution, all areas in the room are pre-disinfected before checking in.The spaceA amazing suite with a view, enjoy a full panoramic view of the KLCC Twin Towers and the KL skyline. Day or Night. Stylish decorated with a small private seated area to enjoy a good cup of coffee or tea.Guest accessThere are 2 Infinity pools here, located on Level 48 and Level 8.Level 48 is the rooftop infinity pool and gym. There's a small entry fees of USD 4 per person for the pool and gym usage. Children under 12 years old are not allowed. Proper swimwear is needed.Level 8 is the Garden view infinity pool and kids pool The pool entry fee is free of charge.Both Level 48 infinity pool, Gym and Level 8 infinity pool opening hours are 8am till 10pm.Other things to noteAncient Sights.1) KLCC Twin Tower - 3km2) Subway - 200m3) Bukit Bintang Pavillion \u0026 Lot 10, Berjaya Times Square - 4km4) Jalan Alor Night Market - 4km5) Changkat Bukit Bintang restaurants and night bars - 4km6) Dataran Merdeka (Independence Square) - 4km7) Sultan Abdul Samad Building - 4 km8) China Town - 5 km9) Central Market - 5km10) KL Tower - 4 km11) Botanical Garden - 5 km12) Bird Park - 5km13) Black Wind Cave - 8 km14) Thean Hou Temple - 15 km15) Terminal Building Bus Station - 20 km15) Putrajaya - 30 km16) Genting Highlands and outlet mall - 35km17) KLIA 1 and KLIA 2 Airport - 60km",
          "guests": "2",
          "home_span": "Popular homes in Kuala Lumpur"
        }
      },
      {
        "title": "Serviced apartment in Kuala Lumpur · ★4.85 · 1 bedroom · 1 bed · 1 bath",
        "price": "$71 for 2 nights",
        "location": "Kuala Lumpur",
        "rating": "4.85",
        "url": "https://www.airbnb.com/rooms/635481064627920753",
        "details": {
          "amenities": "",
          "baths": "1",
          "bedrooms": "1",
          "beds": "1",
          "description": "",
          "guests": "2",
          "home_span": "Popular homes in Kuala Lumpur"
        }
      },
      {
        "title": "Condo in Kuala Lumpur · ★4.82 · Studio · 1 bed · 1 bath",
        "price": "$71 for 2 nights",
        "location": "Kuala Lumpur",
        "rating": "4.82",
        "url": "https://www.airbnb.com/rooms/1005022077370914380",
        "details": {
          "amenities": "",
          "baths": "1",
          "beds": "1",
          "description": "",
          "guests": "2",
          "home_span": "Popular homes in Kuala Lumpur"
        }
      }
    ]
  },
  {
    "category": "Available next month in Bangkok",
    "listings": [
      {
        "title": "Old Town - Wat Pho, Grand Palace",
        "price": "$60 for 2 nights",
        "location": "Bangkok",
        "rating": "4.94",
        "url": "https://www.airbnb.com/rooms/865644099007672422",
        "details": {
          "amenities": "",
          "description": "218 located in Old Town Bangkok, surrounded Thai historical spots ; short walk to Grand Palace, Wat Pho and many attractionsOld commercial building is newly renovated The cozy private room on 3rd floor (no elevator) with king sized bed and en-suited bathroom1st Floor common area :-living room with pantry equipped with TV, wifi , air-conditioner, sofa, armchair, table, microwave, kettle,toaster and fridge.(kitchenware is not suitable for serious cooking as home cook)The spaceThe room will be one private room with en-suite bathroom on 3rd floor, very comfortable mattress ton ensure your good sleep , small sitting areaDuring your stayMy co-host live nearby and will be accessible to help with whatever you need",
          "guests": "94",
          "home_span": "Available next month in Bangkok"
        }
      },
      {
        "title": "Brand New! s87 # BTS On Nut/Duplex Apartment Loft/City View/Pool",
        "price": "$104 for 2 nights",
        "location": "Bangkok",
        "rating": "4.9",
        "url": "https://www.airbnb.com/rooms/1012580984161557102",
        "details": {
          "amenities": "",
          "baths": "1",
          "bedrooms": "1",
          "beds": "1",
          "description": "This unique place has a style all its own.Other things to note1. My room is self-service and there is no 24-hour service.2. My condo haven’t place to parking, cannot park 3. Disposable items / bottles water / Toothpaste and toothbrush are not provided indoors.4. No additional towels are provided. if want have a fees. 5. No daily cleaning. if want daily cleaning will have a fees 6. Garbage can't be thrown out the door, it needs to be thrown into the garbage room ( nearby the lift)7. No smoking, including balcony",
          "guests": "2",
          "home_span": "Available next month in Bangkok"
        }
      },
      {
        "title": "Rental unit in Khet Huai Khwang · ★4.96 · 1 bedroom · 1 bed · 1 private bath",
        "price": "$41 for 2 nights",
        "location": "Bangkok",
        "rating": "4.96",
        "url": "https://www.airbnb.com/rooms/1245878818590732072",
        "details": {
          "amenities": "",
          "beds": "1",
          "description": "",
          "guests": "96",
          "home_span": "Available next month in Bangkok"
        }
      }
    ]
  },
  {
    "category": "Stay in Seoul",
    "listings": [
      {
        "title": "Clara House Rm #08(2F), Seoul Stn. - 1 single",
        "price": "$64 for 2 nights",
        "location": "Seoul",
        "rating": "4.93",
        "url": "https://www.airbnb.com/rooms/955744892195764611",
        "details": {
          "amenities": "",
          "baths": "1",
          "beds": "1",
          "description": "Enjoy a comfortable stay in a quiet accommodation right in the heart of the city* This is a guest room in a two-story house with a shared bathroom and shared kitchen.(A total of 10 guest rooms, maximum 17 guests)* There are 5 shared bathrooms/toilets only.(1 bathroom for every 2 guest rooms/approximately 1 for every 3 guests)Relax in a quiet accommodation in the center.* This is a guest room in a two-story house with a shared bathroom and shared kitchen. (Total number of guest rooms: 10, maximum number of guests: 17)* 5 shared bathrooms/toilets are available without any inconvenience. (1 per 2 guest rooms/1 per 3 people maximum)Registration DetailsRegion of Issuance: 서울특별시, 용산구License Type: 외국인관광도시민박업License Number: 2023-000056",
          "guests": "93",
          "home_span": "Stay in Seoul"
        }
      },
      {
        "title": "304 Dongdaemun The BAO: Cozy private bedroom \u0026 private bathroom (downtown station area)",
        "price": "$76 for 2 nights",
        "location": "Seoul",
        "rating": "4.94",
        "url": "https://www.airbnb.com/rooms/1457249423533314519",
        "details": {
          "amenities": "",
          "bedrooms": "1",
          "beds": "1",
          "description": "",
          "guests": "1",
          "home_span": "Stay in Seoul"
        }
      },
      {
        "title": "a place where one can rest quietly Yeonnam-dong, a quiet resting place",
        "price": "$72 for 2 nights",
        "location": "Seoul",
        "rating": "4.74",
        "url": "https://www.airbnb.com/rooms/42366099",
        "details": {
          "amenities": "",
          "baths": "1",
          "bedrooms": "1",
          "beds": "1",
          "description": "",
          "guests": "1",
          "home_span": "Stay in Seoul"
        }
      }
    ]
  },
  {
    "category": "Available next month in Tokyo",
    "listings": [
      {
        "title": "6 minutes from Shinjuku station",
        "price": "$159 for 2 nights",
        "location": "Tokyo",
        "rating": "4.93",
        "url": "https://www.airbnb.com/rooms/1368852879726685770",
        "details": {
          "amenities": "",
          "baths": "1",
          "bedrooms": "1",
          "beds": "1",
          "description": "The room is located at 3 minutes from Nakano-shinbashi station by foot. It is 6minutes (3 stations, 3km) from Shinjuku station when you take the direct train.To be honest, the building is quite old and the room is at 3rd floor without elevator.The room has 15 square meters which has enough room for one or two people. the bed size is 140×200cm.There is not washlet (bidet seat) or television.Supermarket, convenience store, drug store, coin laundry, café, are all in 3-5minutes by foot.Registration DetailsHotels and Inns Business Act | 中野区保健所 | 7中健衛環第281号",
          "guests": "2",
          "home_span": "Available next month in Tokyo"
        }
      },
      {
        "title": "New open / 3 minutes walk from Hatsudai Station / 2 minutes from Shinjuku Station / Quiet accommodation in a residential area",
        "price": "$143 for 2 nights",
        "location": "Tokyo",
        "rating": "4.78",
        "url": "https://www.airbnb.com/rooms/1532966789201148753",
        "details": {
          "amenities": "",
          "baths": "1",
          "bedrooms": "1",
          "beds": "1",
          "description": "🌿 Relax and feel the real Tokyo life in this quiet and convenient Tokyo city retreat.🚆 Convenient transportation · Travel without worries・ 2-minute walk from Keio New Line \"Hatsudai Station\", only 1 stop to \"Shinjuku Station\" (about 2 minutes)・ Transfer to JR Yamanote Line, Tokyo Metro Marunouchi Line, Fukutoshin Line, Toei Oedo Line and other major lines for easy access to all parts of Tokyo・ Popular areas such as Shibuya, Harajuku, Omotesando, Ginza, Roppongi, etc. can be reached within about 10-20 minutes🏮 Great location · Experience the charm of Tokyo city and life・ Walking distance to Tokyo Opera City, New National Theater, feel the art and culture・ Close to Shinjuku Central Park and Yoyogi Park, where nature and urban landscapes coexist・ There are plenty of dining options in the surrounding area, from authentic izakayas, cafes to popular dessert shops.🏙️ Convenient living · Comfortable and secure・ Convenience store, supermarket, drugstore within 3 minutes walk・ Free Wi-Fi is available・ 24-hour free access (key box self check-in)The space🏢 Safe and Cozy Modern ApartmentThe entrance to the first floor of the building is equipped with an automatic door lock, and the entrance and corridor are equipped with surveillance cameras to ensure safety.Each room can accommodate 1 person maximum.There are 4 private rooms in the building, located on different floors.Suitable for groups, families or friends (multiple rooms can be booked at the same time).Taxis are easily available in front of the building.There is no free parking in the apartment, but there are several coin parking lots nearby.The bathroom has a toilet with flushing and bidet functions.Free high-speed Wi-Fi is available for remote work.🛏️ Room Facilities at a Glance● Single bed × 1 (bed width 100cm)● Bathroom● Private bathroom (shampoo, conditioner, body soap)● Air conditioner (hot and cold)● Hairdryer● Electric kettle, pots, cups, plates, chopsticks, spoons, forks● Microwave● Refrigerator● Clean bath towels and face towels (prepared according to the number of guests)● Free Wi-FiGuest access1. We will reserve the entire room for you, you do not need to share the space with others.2. The room is fully equipped with amenities, please feel free to use them.3. A detailed check-in guide will be sent before your check-in, explaining how to access the room and use the facilities.4. Please feel free to contact us if you have any questions.Registration DetailsM130055830",
          "guests": "1",
          "home_span": "Available next month in Tokyo"
        }
      },
      {
        "title": "Hanshe 3*112, new, 2 min to sta. Skytree \u0026 Asakusa",
        "price": "$151 for 2 nights",
        "location": "Tokyo",
        "rating": "5.0",
        "url": "https://www.airbnb.com/rooms/1526594979875141534",
        "details": {
          "amenities": "",
          "baths": "1",
          "bedrooms": "1",
          "beds": "1",
          "description": "Welcome to Hanshe Hotel! Our team has been operating the Hanshe brand since 2016, dedicated to creating high-value accommodations. Hanshe Building No. 3 was newly completed in October 2025, just a 2-minute walk from the station, offering a convenient apartment with easy access to Tokyo Skytree.The spaceAccommodation InformationAddress: 5-5-5 Higashi-Mukojima, Tokyo🔴 Highlights2-minute walk to Higashi-Mukojima StationNewly built apartment5-minute subway ride (2 stops) to Tokyo Skytree, a new landmark surrounded by an aquarium, planetarium, museum, large shopping mall, restaurants, and supermarkets; enjoy the summer fireworks festival8-minute subway ride (3 stops) to Asakusa’s Senso-ji Temple, a historic Edo-era landmarkApproximately 20-minute train ride to Ueno or AkihabaraWithin 40 minutes by subway to popular attractions like Ginza, Shinjuku, Shibuya, and RoppongiSupermarkets, pharmacies, vegetable/fruit shops, coffee shops, and various restaurants within a 2-minute walkFully equipped interiors for a cozy, home-like experienceDirect access to Lumine, a large department store (at Kita-Senju Station)Free Wi-Fi20 rooms, ideal for large groupsPerfect for solo travelers, friends, couples, families, or business trips.📦 Services Provided✅ Online check-in/self-check-in supported✅ Luggage storage available (please contact in advance)Registration DetailsHotels and Inns Business Act | 墨田区保健所 | 7墨衛生環第282号",
          "guests": "2",
          "home_span": "Available next month in Tokyo"
        }
      }
    ]
  }
]